[
  {
    "id": "1",
    "title": "Alumni Meet",
    "description": "Connecting the past with the present.",
    "poster": "/Events 2k25-26/Alumni Meet.png",
    "color": "#F4EDE4",
    "galleryImages": [
      "/uploads/file-1767280160816-27775492.jpg"
    ],
    "date": "2025-08-09",
    "participants": "25",
    "row": "1",
    "longDescription": "The Alumni Meet is a special virtual gathering designed to reconnect former and current members of the club in a meaningful and engaging setting. The event celebrates shared experiences, achievements, and the journey of the community while fostering mentorship, networking, and knowledge exchange. By bringing together alumni and present members, the meet strengthens long-term connections and reinforces the club’s legacy, vision,collaborative spirit."
  },
  {
    "id": "2",
    "title": "Camera Handling Workshop",
    "description": "Mastering the art of capturing moments.",
    "poster": "/Events 2k25-26/Camera Handling Workshop .jpg",
    "color": "#E7F0F7",
    "galleryImages": [
      "/uploads/file-1767272949986-689344658.jpg",
      "/Events 2k25-26/Event 2 - Camera Handling/20251102_110632.jpg",
      "/Events 2k25-26/Event 2 - Camera Handling/20251102_114959.jpg"
    ],
    "date": "2025-11-02",
    "participants": "96",
    "row": "1",
    "longDescription": "The Camera Handling Workshop is a practical session focused on building a strong foundation in camera operation and on-set techniques. Participants will learn framing, movement, focus control, and handling practices essential for effective visual storytelling. Designed for beginners and aspiring filmmakers, the workshop emphasizes hands-on learning and industry-relevant skills used in film and content production."
  },
  {
    "id": "3",
    "title": "Cineshark",
    "description": "Dive into the depths of cinema.",
    "poster": "/Events 2k25-26/Cineshark .jpg",
    "color": "#F7E7E7",
    "galleryImages": [
      "/Events 2k25-26/Event 3 - Cineshark/IMG_0042.JPG",
      "/Events 2k25-26/Event 3 - Cineshark/IMG_0056.JPG",
      "/Events 2k25-26/Event 3 - Cineshark/IMG_0109.JPG"
    ],
    "date": "2025-09-24",
    "participants": "32",
    "row": "1",
    "longDescription": "Cine Shark is a strategy-driven pitching event where participants reimagine an underperforming film as a potential blockbuster. Teams analyze creative and commercial aspects, pitch innovative improvements, and propose investment strategies to achieve profitability. The event combines cinema, business thinking, and presentation skills, offering a dynamic platform to showcase creativity, market awareness, and strategic decision-making."
  },
  {
    "id": "4",
    "title": "Cineshot Memes",
    "description": "Where humor meets creativity.",
    "poster": "/Events 2k25-26/Cineshot Memes (1).jpg",
    "color": "#F4EDE4",
    "galleryImages": [
      "/Events 2k25-26/Event 4 - Cineshot/Jamie Chastain.png",
      "/uploads/file-1767273824697-888348140.jpg",
      "/uploads/file-1767273834871-800741438.jpg"
    ],
    "participants": "14",
    "row": "1",
    "longDescription": "Cineshot Memes is a creative online event that encourages participants to express their passion for cinema through visual storytelling and humor. By transforming iconic film moments into engaging meme content, the event blends creativity, cinematic knowledge, and digital expression. It provides a platform for participants to showcase originality while celebrating movies in a fun, structured, and engaging format.",
    "date": "2025-09-24"
  },
  {
    "id": "5",
    "title": "Cineverse",
    "description": "Exploring the universe of films.",
    "poster": "/Events 2k25-26/Cineverse (1).jpg",
    "color": "#E7F0F7",
    "galleryImages": [
      "/uploads/file-1767273525022-154843130.jpg",
      "/Events 2k25-26/Event 5 - Cineverse/WhatsApp Image 2025-12-13 at 20.20.59.jpeg",
      "/Events 2k25-26/Event 5 - Cineverse/WhatsApp Image 2025-12-13 at 20.21.29.jpeg"
    ],
    "date": "2025-06-15",
    "participants": "40",
    "row": "1",
    "longDescription": "Cineverse is an interactive, cinema-themed event that challenges participants’ knowledge, observation skills, and creative thinking through engaging rounds where teams decode connections, interpret film plots in unconventional ways, and identify movies using visual cues, fostering collaboration, quick reasoning, and a deeper appreciation of storytelling while offering film enthusiasts a dynamic platform to compete, connect, and showcase their cinematic insight in an energetic, well-structured format"
  },
  {
    "id": "6",
    "title": "Colour Grading Workshop",
    "description": "Painting emotions with valid colors.",
    "poster": "/uploads/file-1767273112769-100281757.jpg",
    "color": "#F7E7E7",
    "galleryImages": [
      "/uploads/file-1767273128463-994718950.jpg",
      "/Events 2k25-26/Event 6 - Colour Grading/WhatsApp Image 2025-10-28 at 20.46.52.jpeg",
      "/Events 2k25-26/Event 6 - Colour Grading/WhatsApp Image 2025-10-28 at 20.46.53.jpeg"
    ],
    "date": "2025-06-13",
    "participants": "47",
    "row": "1",
    "longDescription": "This workshop introduces participants to the fundamentals of professional colour grading using DaVinci Resolve. The session covers essential concepts, basic workflows, and practical techniques used in film and digital content production. Designed for beginners and aspiring creators, the workshop offers clear, hands-on insights that help enhance visual storytelling and improve post-production quality."
  },
  {
    "id": "7",
    "title": "How to make a Shortfilm",
    "description": "A guide for aspiring filmmakers.",
    "poster": "/Events 2k25-26/How to make a Shortfilm as a Student.png",
    "color": "#F4EDE4",
    "galleryImages": [
      "/Events 2k25-26/Event 7 - How to make a Shortfilm/20250903_121217.jpg",
      "/Events 2k25-26/Event 7 - How to make a Shortfilm/20250903_122022.jpg",
      "/Events 2k25-26/Event 7 - How to make a Shortfilm/20250903_125556.jpg"
    ],
    "date": "2025-09-03",
    "participants": "173",
    "row": "2",
    "longDescription": "From Campus to Camera is a hands-on workshop designed to introduce students to the fundamentals of short film making. The session covers the complete creative process—from idea development and scripting to camera basics, lighting, and execution. Aimed at aspiring filmmakers, the workshop provides practical insights into translating stories into visual narratives, empowering students to confidently begin their journey in cinema."
  },
  {
    "id": "8",
    "title": "Meesaya Murukku",
    "description": "Celebrating the spirit of independence.",
    "poster": "/Events 2k25-26/Meesaya murukku.png",
    "color": "#E7F0F7",
    "galleryImages": [
      "/uploads/file-1767274662043-478129375.jpg",
      "/uploads/file-1767274692940-674838486.jpg",
      "/Events 2k25-26/Event 8 - Meesaya Muruku/IMG_7864.jpeg"
    ],
    "date": "2025-08-26",
    "participants": "327",
    "row": "2",
    "longDescription": "Meesaya Murukku is an exclusive film screening event curated for first- and second-year students, offering an engaging cinematic experience within the campus community. The event aims to bring students together through storytelling, entertainment, and shared viewing, creating a relaxed yet organized environment for cultural engagement. Designed with attention to quality and audience experience, the screening promotes community bonding while celebrating contemporary cinema in a structured and professional setting."
  },
  {
    "id": "9",
    "title": "Poster Reimagined",
    "description": "Redefining visual storytelling.",
    "poster": "/uploads/file-1767273193074-544616392.jpg",
    "color": "#F7E7E7",
    "galleryImages": [
      "/Events 2k25-26/Event 9 - Poster Reimagined/2.png",
      "/Events 2k25-26/Event 9 - Poster Reimagined/3.png",
      "/Events 2k25-26/Event 9 - Poster Reimagined/4.png"
    ],
    "participants": "15",
    "row": "2",
    "longDescription": "Poster Reimagined is a creative design challenge that invites participants to reinterpret iconic movie posters through their own artistic vision. The event encourages originality, visual storytelling, and design thinking as participants transform familiar cinematic visuals into fresh, imaginative concepts. Conducted in an online format, the competition provides a platform to showcase creativity, technical skill, and innovation while celebrating the art of film poster design.",
    "date": "2025-08-24"
  },
  {
    "id": "10",
    "title": "Retrograde",
    "description": "A blast from the past.",
    "poster": "/Events 2k25-26/Retrograde.png",
    "color": "#F4EDE4",
    "galleryImages": [
      "/uploads/file-1767272858283-941878823.jpg",
      "/Events 2k25-26/Event 10 - Retrograde/1273640d-d2cf-4592-86d8-a846951d0331.jpg",
      "/Events 2k25-26/Event 10 - Retrograde/3e4c8f79-5fe9-42eb-9562-28d6248b3a20.jpg"
    ],
    "participants": "68",
    "row": "2",
    "longDescription": "Retrograde is an open mic event that celebrates the fusion of classic and contemporary performance styles. Centered around the theme of old versus new, the event invites participants to reinterpret timeless art forms through a modern lens. From nostalgic influences to fresh expressions, Retrograde offers a vibrant platform for performers to showcase creativity, talent, and individuality in an engaging and supportive cultural setting.",
    "date": "2025-09-29"
  },
  {
    "id": "11",
    "title": "Video Editing Workshop",
    "description": "Crafting stories frame by frame.",
    "poster": "/Events 2k25-26/Video Editing Workshop .jpg",
    "color": "#E7F0F7",
    "galleryImages": [
      "/Events 2k25-26/Event 11 - Editing Work/IMG_20251101_105401.jpg",
      "/Events 2k25-26/Event 11 - Editing Work/IMG_20251101_111930.jpg",
      "/Events 2k25-26/Event 11 - Editing Work/IMG_20251101_114030.jpg"
    ],
    "date": "2025-11-01",
    "participants": "106",
    "row": "2",
    "longDescription": "The Video Editing Workshop is a hands-on learning session designed to introduce participants to essential video editing techniques and workflows. The workshop covers cutting, transitions, effects, and storytelling principles used to transform raw footage into polished cinematic content. Ideal for beginners and aspiring editors, the session focuses on practical skills, creative clarity, and industry-relevant practices."
  },
  {
    "id": "12",
    "title": "Curtain Raiser",
    "description": "Unveiling the magic.",
    "poster": "/Events 2k25-26/curtain raiser.jpeg",
    "color": "#F7E7E7",
    "galleryImages": [
      "/Events 2k25-26/Event 12 - Curtain Raiser/IMG_20250730_121803649.jpg",
      "/Events 2k25-26/Event 12 - Curtain Raiser/IMG_20250730_121842167.jpg",
      "/uploads/file-1767274251135-312727034.jpg"
    ],
    "date": "2025-07-30",
    "participants": "126",
    "row": "2",
    "longDescription": "Curtain Raiser marks the official opening event of the club, setting the stage for the activities and initiatives planned for the year. The event offers an engaging introduction to the club’s vision, creative direction, and upcoming events through a well-structured and interactive session. Designed to inform, inspire, and connect, Curtain Raiser brings together members, coordinators, and attendees to celebrate creativity, collaboration, and the spirit of cinema in a professional and welcoming environment."
  },
  {
    "id": "13",
    "title": "Cineshark 2.0",
    "description": "The sequel to the saga.",
    "poster": "/Events 2k25-26/Cineshark 2.0.jpeg",
    "color": "#F4EDE4",
    "galleryImages": [
      "/Events 2k25-26/Event 13 - Cineshark 2.0/IMG_5235.jpeg",
      "/Events 2k25-26/Event 13 - Cineshark 2.0/IMG_5307.jpeg",
      "/Events 2k25-26/Event 13 - Cineshark 2.0/IMG_5362.jpeg"
    ],
    "participants": "66",
    "row": "2",
    "longDescription": "Cine Shark 2.0 is a competitive pitching event that challenges participants to transform an underperforming film into a profitable cinematic success. Teams analyze creative potential, develop strategic improvements, and present investment-driven pitches aimed at reaching breakeven and beyond. Blending cinema, business strategy, and presentation skills, the event offers a dynamic platform to showcase innovation, market insight, and competitive thinking.",
    "date": "2025-10-31"
  }
]